# Value Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StringParameterValue..::..Value Property
StringParameterValue Class See Also
---
The stored value
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public string Value { get; set; }
```

Visual Basic
---
```text
Public Property Value As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Value {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
StringParameterValue Class
Autodesk.Revit.DB Namespace